backend/controllers/ImsindexController.php

    public function actionImgadd(){
        $model=new ImgIndexImg();
        $model->status = 1;
        $model->img_type = 1;
        if($model->load(Yii::$app->request->post())){
            $img=Yii::$app->helper->update_img($model,'img',Yii::getAlias('@frontendupload'));
            if($img['code']==1){
                $model->img=!empty($img['img_url'])?'/upload/'.$img['img_url']:"";
            }else{
                Yii::$app->getSession()->setFlash('error', '未上传图片或图片保存失败');
            }
            if($model->save()){
---
INSERT INTO `img_index_img` (`status`, `img_type`, `img`, `img_text`, `img_content`, `link`, `creattime`) VALUES (1, 1, '/upload/201912/09/1575858192_portfolio_04.jpg', 'ceshi 3', 'ceshi 6', '', 1575858192)

    public function awsome_list()
    {
        $model = new Awesome();
        $list = $model::find()->select(['name'])->asArray()->all();
---
SELECT `name` FROM `awesome`

    public function actionCircularedit(){
        $model=$this->findCircular(Yii::$app->request->get('id'));
        if($model->load(Yii::$app->request->post())){

            $img=Yii::$app->helper->update_img($model,'img',Yii::getAlias('@frontendupload'));
            if($img['code']==1){
                $model->img=!empty($img['img_url'])?"/upload/".$img['img_url']:"";
            }else{
                unset($model->img);
                Yii::$app->getSession()->setFlash('error', '未上传图片或图片保存失败');
            }
            if($model->save()){
---
UPDATE `ims_circular` SET `title`='公众号', `content`='测试', `link`='', `type`='0', `img`='/upload/201912/09/1575859633_1557814805.png' WHERE `id`=1

    protected function findCircular($id)
    {
        if (($model = ImsCircular::findOne($id)) !== null) {
---
SELECT * FROM `ims_circular` WHERE `id`='1'