backend/controllers/UserpermissionController.php

SELECT `permission_name`, `permission_id` FROM `user_permission` WHERE `type`=0
SELECT `permission_name`, `permission_id` FROM `user_permission` WHERE `type`=1
---
    public function actionCreate()
    {
        $model = new Userpermission();

        $pid=$model::find()->select(['permission_name','permission_id'])->where(['type'=>0])->all();
        $fid=$model::find()->select(['permission_name','permission_id'])->where(['type'=>1])->all();

SELECT * FROM `user_permission`
---
    public function actionRolelist(){
       $permission_name=Yii::$app->request->get('Userpermission');