backend/controllers/UserroleController.php

    protected function findModel($id)
    {
        if (($model = Userrole::findOne($id)) !== null) {
---
SELECT * FROM `user_role` WHERE `roleid`='1'