frontend/controllers/IndexController.php

SELECT * FROM `ims_index` WHERE `id`=1
SELECT * FROM `img_index_img` WHERE `status`=1
SELECT * FROM `ims_circular`
---
    public function actionIndex()
    {
        $model=new ImsIndex();
        $info=$model::find()->where(['id'=>1])->one();
        $img_model=new ImgIndexImg();
        $img=$img_model::find()->where(['status'=>1])->asArray()->all();
        $circular_img=new ImsCircular();
        $circular=$circular_img::find()->all();