backend/models/Userpermission.php

    public function role_all()
    {
        $role_array = array();
        $role_all = Userpermission::find()
            ->where(['type' => 0])
            ->orderBy('aort')
            ->all();
        foreach ($role_all as $v) {
            $role_array[$v->permission_id] = array(
                'p_info' => array(
                    $v->permission_id => $v->permission_name,
                ),
                'pid' => $v->permission_id,
            );
        }


        foreach ($role_array as $k => $v) {
            $role_list = Userpermission::find()
                ->select(['permission_name', 'permission_id', 'type', 'fid'])
                ->where(['pid' => $k])
                ->orderBy('aort')
                ->asArray()
                ->all();
---
SELECT * FROM `user_permission` WHERE `type`=0 ORDER BY `aort`
SELECT `permission_name`, `permission_id`, `type`, `fid` FROM `user_permission` WHERE `pid`=2 ORDER BY `aort`