backend/models/UserPermissionRelation.php

    public function role_all_def($role_id)
    {
        $info = UserPermissionRelation::find()
            ->select(['permission_id'])
            ->where(['role_id' => $role_id])
            ->asArray()
            ->all();
        $info = ArrayHelper::getColumn($info, 'permission_id');

        $role_all = Userpermission::find()
            ->select(['permission_id'])
            ->where(['type' => 0])
            ->asArray()
            ->orderBy('aort')
            ->all();

        foreach ($role_all as $v) {
            $role_all_info = Userpermission::find()
                ->select(['permission_id'])
                ->where(['pid' => $v['permission_id']])
                ->asArray()
                ->all();
---
SELECT `permission_id` FROM `user_permission_relation` WHERE `role_id`='1'
SELECT `permission_id` FROM `user_permission` WHERE `type`=0 ORDER BY `aort`
SELECT `permission_id` FROM `user_permission` WHERE `pid`='2'

    public function allinster($params)
    {
        if (!empty($params)) {
            $time = time();
            /**清除原有的授权*/
            $del = UserPermissionRelation::deleteAll(['role_id' => $params['role_id']]);

            foreach ($params['permission_id'] as $k => $v) {
                $data[] = array(
                    'role_id' => $params['role_id'],
                    'permission_id' => $v,
                    'create_time' => $time,
                );
            }
            /**更新授权*/
            $info = Yii::$app->db->createCommand()->batchInsert(UserPermissionRelation::tableName(), ['role_id', 'permission_id', 'create_time'], $data)->execute();
---
DELETE FROM `user_permission_relation` WHERE `role_id`='1'
INSERT INTO `user_permission_relation` (`role_id`, `permission_id`, `create_time`) VALUES ('1', '2', 1575449370), ('1', '3', 1575449370), ('1', '4', 1575449370), ('1', '5', 1575449370), ('1', '6', 1575449370), ('1', '11', 1575449370), ('1', '26', 1575449370), ('1', '7', 1575449370), ('1', '9', 1575449370), ('1', '8', 1575449370), ('1', '10', 1575449370), ('1', '19', 1575449370), ('1', '21', 1575449370), ('1', '22', 1575449370), ('1', '23', 1575449370), ('1', '24', 1575449370), ('1', '25', 1575449370)

    public function menu($id)
    {
        $info = UserPermissionRelation::find()
            ->select(['p.permission_name','p.permission_route','p.type','p.pid','p.aort','p.permission_id'])
            ->from('user_permission_relation r')
            ->leftJoin('user_permission p','p.permission_id=r.permission_id')
            ->where(['role_id' => $id])
            ->asArray()
            ->all();
---
SELECT `p`.`permission_name`, `p`.`permission_route`, `p`.`type`, `p`.`pid`, `p`.`aort`, `p`.`permission_id` FROM `user_permission_relation` `r` LEFT JOIN `user_permission` `p` ON p.permission_id=r.permission_id WHERE `role_id`=1