backend/components/Log.php

INSERT INTO `log` (`ip`, `user`, `creatime`, `type`, `content`, `status`) VALUES ('::1', 'zhaozilong', 1575859633, 0, '添加三圆-1', 1)
---
   function ins($type,$content,$status){
        $model=new LogForm();
        $model->ip=$_SERVER['REMOTE_ADDR'];
        $model->user=Yii::$app->user->identity->username;
        $model->creatime=time();
        $model->type=$type;
        $model->content=$content;
        $model->status=$status;
        $model->save();